АлогистикТест2/src/Documents/алк_ПриемкаСОтветхранения/алк_ПриемкаСОтветхранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПриемкаСОтветхранения</name>
  <basedOn>Document.алк_ПриемкаЛесопродукции</basedOn>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииНаОтветхранении</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииГОСТ</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Сечение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельПриемки</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСмены</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СменаУдалить</name>
      <type>
        <types>EnumRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияТД</name>
      <type>
        <types>DocumentRef.рфп_ОтгрузкаВагона</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСертификатFSC</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.алк_Смены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПроизводства</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Остатки</name>
  </enumValues>
  <enumValues>
    <name>Произведено</name>
  </enumValues>
  <enumValues>
    <name>Подано</name>
  </enumValues>
  <enumValues>
    <name>Получено</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Упаковано</name>
    <comment>Упаковано объема</comment>
  </enumValues>
  <enumValues>
    <name>Выход</name>
  </enumValues>
  <enumValues>
    <name>УпакованоШтук</name>
    <comment>Упаковано штук пакетов</comment>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование1</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование2</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование3</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеНаКотельную</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырья</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЕль</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЛиственница</name>
  </enumValues>
  <enumValues>
    <name>КРСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>КРСОбщий</name>
  </enumValues>
  <enumValues>
    <name>ОстатокВСилосе</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяВсего</name>
  </enumValues>
  <enumValues>
    <name>ГранулированиеСреднее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКора</name>
  </enumValues>
  <enumValues>
    <name>ПоступилоНаБиржу</name>
    <comment>ВходящийТранспорт. Привезли еще не разгружался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСобственнымиСилами</name>
    <comment>ВходящийТранспортРазгрузили еще не сортировался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСиламиПодрядчика</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСырьяПослеДробления</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПриемкаСОтветхранения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПриемкаСОтветхранения, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПриемкаСОтветхраненияЗапасы.ДатаСмены,
		|	алк_ПриемкаСОтветхраненияЗапасы.Смена,
		|	алк_ПриемкаСОтветхраненияЗапасы.СтруктурнаяЕдиница,
		|	алк_ПриемкаСОтветхраненияЗапасы.Штабель,
		|	алк_ПриемкаСОтветхраненияЗапасы.Номенклатура,
		|	алк_ПриемкаСОтветхраненияЗапасы.Характеристика,
		|	алк_ПриемкаСОтветхраненияЗапасы.Количество,
		|	алк_ПриемкаСОтветхраненияЗапасы.Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	алк_ПриемкаСОтветхраненияЗапасы.ПартияТД,
		|	алк_ПриемкаСОтветхраненияЗапасы.Партия,
		|	алк_ПриемкаСОтветхраненияЗапасы.Организация,
		|	алк_ПриемкаСОтветхраненияЗапасы.УдалитьСертификатFSC,
		|	алк_ПриемкаСОтветхраненияЗапасы.Сертификат,
		|	ВЫБОР
		|		КОГДА алк_ПриемкаСОтветхраненияЗапасы.Ссылка.Контрагент.Партнер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА алк_ПриемкаСОтветхраненияЗапасы.Ссылка.Контрагент
		|		ИНАЧЕ алк_ПриемкаСОтветхраненияЗапасы.Ссылка.Контрагент.Партнер
		|	КОНЕЦ КАК Контрагент
		|ИЗ
		|	Документ.алк_ПриемкаСОтветхранения.Запасы КАК алк_ПриемкаСОтветхраненияЗапасы
		|ГДЕ
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка.Ссылка = &Ссылка";

		
		Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПриемкаСОтветхранения.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПриемкаСОтветхранения);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетОтветхранения", МассивРезультатов[0].Выгрузить());
		
		СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаПриемкаСОтветхранения, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаУчетЛесопродукцииГОСТ(ДокументСсылкаПриемкаСОтветхранения, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПриемкаСОтветхранения, СтруктураДополнительныеСвойства);
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаПриемкаСОтветхранения, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПриемкаСОтветхраненияЗапасы.Организация,
		|	алк_ПриемкаСОтветхраненияЗапасы.Номенклатура,
		|	алк_ПриемкаСОтветхраненияЗапасы.Характеристика,
		|	алк_ПриемкаСОтветхраненияЗапасы.Количество,
		|	алк_ПриемкаСОтветхраненияЗапасы.Объем,
		|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
		|	&Период,
		|	алк_ПриемкаСОтветхраненияЗапасы.ДатаСмены,
		|	алк_ПриемкаСОтветхраненияЗапасы.Смена,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаСОтветхранения) КАК Операция,
		|	алк_ПриемкаСОтветхраненияЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка.ШтабельПриемки КАК Ячейка,
		|	алк_ПриемкаСОтветхраненияЗапасы.Сертификат
		|ИЗ
		|	Документ.алк_ПриемкаСОтветхранения.Запасы КАК алк_ПриемкаСОтветхраненияЗапасы
		|ГДЕ
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПриемкаСОтветхраненияЗапасы.Организация,
		|	алк_ПриемкаСОтветхраненияЗапасы.Номенклатура,
		|	алк_ПриемкаСОтветхраненияЗапасы.Характеристика,
		|	алк_ПриемкаСОтветхраненияЗапасы.Объем,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Поступление) КАК Операция,
		|	&Период,
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка.ШтабельПриемки КАК Штабель,
		|	ЛОЖЬ КАК Ответхранение
		|ИЗ
		|	Документ.алк_ПриемкаСОтветхранения.Запасы КАК алк_ПриемкаСОтветхраненияЗапасы
		|ГДЕ
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		Запрос.УстановитьПараметр("Период", 	ДокументСсылкаПриемкаСОтветхранения.Дата);
		Запрос.УстановитьПараметр("Ссылка", 	ДокументСсылкаПриемкаСОтветхранения);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетЛесопродукцииГОСТ", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов[1].Выгрузить());
		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаУчетЛесопродукцииГОСТ(ДокументСсылкаПриемкаСОтветхранения, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст = 				
		"ВЫБРАТЬ
		|	алк_ПриемкаСОтветхраненияЗапасы.ДатаСмены,
		|	алк_ПриемкаСОтветхраненияЗапасы.Смена,
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка.ШтабельПриемки КАК Штабель,
		|	алк_ПриемкаСОтветхраненияЗапасы.Номенклатура,
		|	алк_ПриемкаСОтветхраненияЗапасы.Характеристика,
		|	алк_ПриемкаСОтветхраненияЗапасы.Количество,
		|	алк_ПриемкаСОтветхраненияЗапасы.Объем,
		|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
		|	&Период,
		|	алк_ПриемкаСОтветхраненияЗапасы.ПартияТД КАК Партия
		|ИЗ
		|	Документ.алк_ПриемкаСОтветхранения.Запасы КАК алк_ПриемкаСОтветхраненияЗапасы
		|ГДЕ
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка.Ссылка = &Ссылка
		|	И алк_ПриемкаСОтветхраненияЗапасы.Ссылка.Проведен"; 		
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		Запрос.УстановитьПараметр("Период", 	ДокументСсылкаПриемкаСОтветхранения.Дата);
		Запрос.УстановитьПараметр("Ссылка", 	ДокументСсылкаПриемкаСОтветхранения);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
				
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетЛесопродукцииГОСТ", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации

	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПриемкаСОтветхранения, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		
		Пользователь = Пользователи.ТекущийПользователь();
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
		ОсновнойОтветственный = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.Сотрудники.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("Сотрудник", ОсновнойОтветственный);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алк_ПриемкаСОтветхраненияЗапасы.Организация КАК Организация,
		|	&Период,
		|	0 КАК МоментПроведения,
		|	&Сотрудник,
		|	алк_ПриемкаСОтветхраненияЗапасы.ДатаСмены,
		|	алк_ПриемкаСОтветхраненияЗапасы.Смена
		|ИЗ
		|	Документ.алк_ПриемкаСОтветхранения.Запасы КАК алк_ПриемкаСОтветхраненияЗапасы
		|ГДЕ
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПриемкаСОтветхранения.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПриемкаСОтветхранения);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		тРезультат = МассивРезультатов[0].Выгрузить();
		
		Для каждого стр Из тРезультат Цикл
			
			стр.МоментПроведения = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
		КонецЦикла; 
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокументыПослБиржа", тРезультат);
		
		
	КонецПроцедуры // СформироватьТаблицаДокументыПослБиржа
	
	#КонецОбласти 
	
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		// 
		// УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", Обработки.алк_ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		// 
		//КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МХ_32") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МХ_32", "Акт приемки с ответхранение.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МХ_32"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "МХ_32";
		КомандаПечати.Представление = НСтр("ru = 'Акт приемки с ответхранение.'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
		//КомандаПечати = КомандыПечати.Добавить();
		//КомандаПечати.Обработчик = "РфпКлиент.ПечатьТН";
		//КомандаПечати.Идентификатор = "ТН";
		//КомандаПечати.Представление = НСтр("ru = 'Приложение №4 (Товарная накладная)'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		//КомандаПечати.Порядок = 23;
		
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "МХ_32" Тогда
				
				Сформировать_МХ_32(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	// Процедура формирования Акта "МХ-1"
	//
	Процедура Сформировать_МХ_32(ТабличныйДокумент, ТекущийДокумент)
		
		МакетАкта = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ПриемкаСОтветхранения.МХ_32");
		
		ОбластьШапка 			= МакетАкта.ПолучитьОбласть("Шапка");
		ОбластьШапкаТаблицы 	= МакетАкта.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрока 			= МакетАкта.ПолучитьОбласть("СтрокаТаблицы");  
		ОбластьПодвал 			= МакетАкта.ПолучитьОбласть("Подвал");
		
		ОбластьШапка.Параметры.Штабель 			= ТекущийДокумент.Штабель;		
		ОбластьШапка.Параметры.Дата  			= Формат(ТекущийДокумент.Дата, "ДЛФ=Д");  
		ОбластьШапкаТаблицы.Параметры.Склад  	= "Склад: " + ТекущийДокумент.СтруктурнаяЕдиница;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
			
		ТЗ = ПолучитьСвернутуюТаблицуЗапасов(ТекущийДокумент.ссылка);
		
		Для каждого стрЗапасы Из ТЗ Цикл
			
			ОбластьСтрока.Параметры.Заполнить(стрЗапасы);			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;     		
		
		ОбластьПодвал.Параметры.ОбъемИтого 			= ТЗ.Итог("Объем");
		ОбластьПодвал.Параметры.КоличествоИтого 	= ТЗ.Итог("Количество");  
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		
	КонецПроцедуры //СформироватьАктПриемки()	
	
	Функция ПолучитьСвернутуюТаблицуЗапасов(СсылкаТекущийДокумент)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПриемкаСОтветхраненияЗапасы.Штабель.Наименование КАК Штабель,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	СУММА(алк_ПриемкаСОтветхраненияЗапасы.Количество) КАК Количество,
		|	СУММА(алк_ПриемкаСОтветхраненияЗапасы.Объем) КАК Объем
		|ИЗ
		|	Документ.алк_ПриемкаСОтветхранения.Запасы КАК алк_ПриемкаСОтветхраненияЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ПриемкаСОтветхраненияЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ПриемкаСОтветхраненияЗапасы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПриемкаСОтветхраненияЗапасы.Штабель.Наименование,
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ПараметрыХарактеристик.Сорт,
		|	алк_ПараметрыХарактеристик.Сечение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаТекущийДокумент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТЗ = РезультатЗапроса.Выгрузить();
		
		Возврат ТЗ;		
		
	КонецФункции // ПолучитьСвернутуюТаблицуЗапасов()
	 
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
#КонецЕсли

Процедура Конец()
КонецПроцедуры
